redstonee/MM32G0001-CMake/Device/MM32G0001/Include/reg_exti.h
/*
 *******************************************************************************
    @file     reg_exti.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
              MM32 FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
    CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
    TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
    CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
    HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
    CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.

    <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_EXTI_H
#define __REG_EXTI_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/**
  * @brief EXTI Base Address Definition
  */
#define EXTI_BASE                       (APB1PERIPH_BASE+0x10000)              /*!< Base Address: 0x40010000 */

/**
  * @brief EXTI Registers Structure Definition
  */
typedef struct {
    __IO uint32_t CFGR;                                                              /*!< configuration register,                        offset: 0x00 */
    uint32_t Reserved;                                                               /*!< Reserved                                       offset: 0x04 */
    __IO uint32_t CR[4];                                                             /*!< External interrupt configuration register,     offset: 0x08 - 0x14 */
    __IO uint32_t PADHYS;
    uint32_t Reserved1[0x100 - 0x07];
    __IO uint32_t IMR;                                                               /*!< Interrupt Mask Register                        offset: 0x00 + 0x400 */
    __IO uint32_t EMR;                                                               /*!< Event Mask Register                            offset: 0x04 + 0x400 */
    __IO uint32_t RTSR;                                                              /*!< Rising Trigger Status Register                 offset: 0x08 + 0x400 */
    __IO uint32_t FTSR;                                                              /*!< Falling Trigger Status Register                offset: 0x0C + 0x400 */
    __IO uint32_t SWIER;                                                             /*!< Software Interrupt Enable Register             offset: 0x10 + 0x400 */
    __IO uint32_t PR;                                                                /*!< Pending Register                               offset: 0x14 + 0x400 */
} EXTI_TypeDef;

/**
  * @brief EXTI type pointer Definition
  */
#define EXTI                            ((EXTI_TypeDef*) EXTI_BASE)

/**
  * @brief EXTI_CFGR Register Bit Definition
  */
#define EXTI_CFGR_MEMMODE_Pos           (0)
#define EXTI_CFGR_MEMMODE               (0x03U << EXTI_CFGR_MEMMODE_Pos)        /*!< EXTI_Memory Remap Config */
#define EXTI_CFGR_MEMMODE_0             (0x01U << EXTI_CFGR_MEMMODE_Pos)        /*!< EXTI_Memory Remap Config Bit 0 */
#define EXTI_CFGR_MEMMODE_1             (0x02U << EXTI_CFGR_MEMMODE_Pos)        /*!< EXTI_Memory Remap Config Bit 1 */
#define EXTI_CFGR_FLASH_MEMORY          (0x00U << EXTI_CFGR_MEMMODE_Pos)        /*!< EXTI_Memory Remap Config Mode 0 */
#define EXTI_CFGR_SYSTEM_MEMORY         (0x01U << EXTI_CFGR_MEMMODE_Pos)        /*!< EXTI_Memory Remap Config Mode 1 */
#define EXTI_CFGR_SRAM_MEMORY           (0x03U << EXTI_CFGR_MEMMODE_Pos)        /*!< EXTI_Memory Remap Config Mode 3 */

/**
  * @brief EXTI_CR1 Register Bit Definition
  */
#define EXTI_CR1_EXTI0_Pos              (0)
#define EXTI_CR1_EXTI0                  (0x0FU << EXTI_CR1_EXTI0_Pos)           /*!< EXTI 0 configuration */
#define EXTI_CR1_EXTI0_PA               (0x00U << EXTI_CR1_EXTI0_Pos)           /*!< PA[0] pin */
#define EXTI_CR1_EXTI0_PB               (0x01U << EXTI_CR1_EXTI0_Pos)           /*!< PB[0] pin */
#define EXTI_CR1_EXTI0_PC               (0x02U << EXTI_CR1_EXTI0_Pos)           /*!< PC[0] pin */
#define EXTI_CR1_EXTI0_PD               (0x03U << EXTI_CR1_EXTI0_Pos)           /*!< PD[0] pin */

#define EXTI_CR1_EXTI1_Pos              (4)
#define EXTI_CR1_EXTI1                  (0x0FU << EXTI_CR1_EXTI1_Pos)           /*!< EXTI 1 configuration */
#define EXTI_CR1_EXTI1_PA               (0x00U << EXTI_CR1_EXTI1_Pos)           /*!< PA[1] pin */
#define EXTI_CR1_EXTI1_PB               (0x01U << EXTI_CR1_EXTI1_Pos)           /*!< PB[1] pin */
#define EXTI_CR1_EXTI1_PC               (0x02U << EXTI_CR1_EXTI1_Pos)           /*!< PC[1] pin */
#define EXTI_CR1_EXTI1_PD               (0x03U << EXTI_CR1_EXTI1_Pos)           /*!< PD[1] pin */

#define EXTI_CR1_EXTI2_Pos              (8)
#define EXTI_CR1_EXTI2                  (0x0FU << EXTI_CR1_EXTI2_Pos)           /*!< EXTI 2 configuration */
#define EXTI_CR1_EXTI2_PA               (0x00U << EXTI_CR1_EXTI2_Pos)           /*!< PA[2] pin */
#define EXTI_CR1_EXTI2_PB               (0x01U << EXTI_CR1_EXTI2_Pos)           /*!< PB[2] pin */
#define EXTI_CR1_EXTI2_PC               (0x02U << EXTI_CR1_EXTI2_Pos)           /*!< PC[2] pin */
#define EXTI_CR1_EXTI2_PD               (0x03U << EXTI_CR1_EXTI2_Pos)           /*!< PD[2] pin */

