redstonee/MM32G0001-CMake/Device/MM32G0001/Include/reg_exti.h
#define EXTI_CR1_EXTI3_Pos              (12)
#define EXTI_CR1_EXTI3                  (0x0FU << EXTI_CR1_EXTI3_Pos)           /*!< EXTI 3 configuration */
#define EXTI_CR1_EXTI3_PA               (0x00U << EXTI_CR1_EXTI3_Pos)           /*!< PA[3] pin */
#define EXTI_CR1_EXTI3_PB               (0x01U << EXTI_CR1_EXTI3_Pos)           /*!< PB[3] pin */
#define EXTI_CR1_EXTI3_PC               (0x02U << EXTI_CR1_EXTI3_Pos)           /*!< PC[3] pin */
#define EXTI_CR1_EXTI3_PD               (0x03U << EXTI_CR1_EXTI3_Pos)           /*!< PD[3] pin */

/**
  * @brief EXTI_CR2 Register Bit Definition
  */
#define EXTI_CR2_EXTI4_Pos              (0)
#define EXTI_CR2_EXTI4                  (0x0FU << EXTI_CR2_EXTI4_Pos)           /*!< EXTI 4 configuration */
#define EXTI_CR2_EXTI4_PA               (0x00U << EXTI_CR2_EXTI4_Pos)           /*!< PA[4] pin */
#define EXTI_CR2_EXTI4_PB               (0x01U << EXTI_CR2_EXTI4_Pos)           /*!< PB[4] pin */
#define EXTI_CR2_EXTI4_PC               (0x02U << EXTI_CR2_EXTI4_Pos)           /*!< PC[4] pin */
#define EXTI_CR2_EXTI4_PD               (0x03U << EXTI_CR2_EXTI4_Pos)           /*!< PD[4] pin */

#define EXTI_CR2_EXTI5_Pos              (4)
#define EXTI_CR2_EXTI5                  (0x0FU << EXTI_CR2_EXTI5_Pos)           /*!< EXTI 5 configuration */
#define EXTI_CR2_EXTI5_PA               (0x00U << EXTI_CR2_EXTI5_Pos)           /*!< PA[5] pin */
#define EXTI_CR2_EXTI5_PB               (0x01U << EXTI_CR2_EXTI5_Pos)           /*!< PB[5] pin */
#define EXTI_CR2_EXTI5_PC               (0x02U << EXTI_CR2_EXTI5_Pos)           /*!< PC[5] pin */
#define EXTI_CR2_EXTI5_PD               (0x03U << EXTI_CR2_EXTI5_Pos)           /*!< PD[5] pin */

#define EXTI_CR2_EXTI6_Pos              (8)
#define EXTI_CR2_EXTI6                  (0x0FU << EXTI_CR2_EXTI6_Pos)           /*!< EXTI 6 configuration */
#define EXTI_CR2_EXTI6_PA               (0x00U << EXTI_CR2_EXTI6_Pos)           /*!< PA[6] pin */
#define EXTI_CR2_EXTI6_PB               (0x01U << EXTI_CR2_EXTI6_Pos)           /*!< PB[6] pin */
#define EXTI_CR2_EXTI6_PC               (0x02U << EXTI_CR2_EXTI6_Pos)           /*!< PC[6] pin */
#define EXTI_CR2_EXTI6_PD               (0x03U << EXTI_CR2_EXTI6_Pos)           /*!< PD[6] pin */

#define EXTI_CR2_EXTI7_Pos              (12)
#define EXTI_CR2_EXTI7                  (0x0FU << EXTI_CR2_EXTI7_Pos)           /*!< EXTI 7 configuration */
#define EXTI_CR2_EXTI7_PA               (0x00U << EXTI_CR2_EXTI7_Pos)           /*!< PA[7] pin */
#define EXTI_CR2_EXTI7_PB               (0x01U << EXTI_CR2_EXTI7_Pos)           /*!< PB[7] pin */
#define EXTI_CR2_EXTI7_PC               (0x02U << EXTI_CR2_EXTI7_Pos)           /*!< PC[7] pin */
#define EXTI_CR2_EXTI7_PD               (0x03U << EXTI_CR2_EXTI7_Pos)           /*!< PD[7] pin */

/**
  * @brief EXTI_CR3 Register Bit Definition
  */
#define EXTI_CR3_EXTI8_Pos              (0)
#define EXTI_CR3_EXTI8                  (0x0FU << EXTI_CR3_EXTI8_Pos)           /*!< EXTI 8 configuration */
#define EXTI_CR3_EXTI8_PA               (0x00U << EXTI_CR3_EXTI8_Pos)           /*!< PA[8] pin */
#define EXTI_CR3_EXTI8_PB               (0x01U << EXTI_CR3_EXTI8_Pos)           /*!< PB[8] pin */
#define EXTI_CR3_EXTI8_PC               (0x02U << EXTI_CR3_EXTI8_Pos)           /*!< PC[8] pin */
#define EXTI_CR3_EXTI8_PD               (0x03U << EXTI_CR3_EXTI8_Pos)           /*!< PD[8] pin */

#define EXTI_CR3_EXTI9_Pos              (4)
#define EXTI_CR3_EXTI9                  (0x0FU << EXTI_CR3_EXTI9_Pos)           /*!< EXTI 9 configuration */
#define EXTI_CR3_EXTI9_PA               (0x00U << EXTI_CR3_EXTI9_Pos)           /*!< PA[9] pin */
#define EXTI_CR3_EXTI9_PB               (0x01U << EXTI_CR3_EXTI9_Pos)           /*!< PB[9] pin */
#define EXTI_CR3_EXTI9_PC               (0x02U << EXTI_CR3_EXTI9_Pos)           /*!< PC[9] pin */
#define EXTI_CR3_EXTI9_PD               (0x03U << EXTI_CR3_EXTI9_Pos)           /*!< PD[9] pin */

#define EXTI_CR3_EXTI10_Pos             (8)
#define EXTI_CR3_EXTI10                 (0x0FU << EXTI_CR3_EXTI10_Pos)          /*!< EXTI 10 configuration */
#define EXTI_CR3_EXTI10_PA              (0x00U << EXTI_CR3_EXTI10_Pos)          /*!< PA[10] pin */
#define EXTI_CR3_EXTI10_PB              (0x01U << EXTI_CR3_EXTI10_Pos)          /*!< PB[10] pin */
#define EXTI_CR3_EXTI10_PC              (0x02U << EXTI_CR3_EXTI10_Pos)          /*!< PC[10] pin */
#define EXTI_CR3_EXTI10_PD              (0x03U << EXTI_CR3_EXTI10_Pos)          /*!< PD[10] pin */

#define EXTI_CR3_EXTI11_Pos             (12)
#define EXTI_CR3_EXTI11                 (0x0FU << EXTI_CR3_EXTI11_Pos)          /*!< EXTI 11 configuration */
#define EXTI_CR3_EXTI11_PA              (0x00U << EXTI_CR3_EXTI11_Pos)          /*!< PA[11] pin */
#define EXTI_CR3_EXTI11_PB              (0x01U << EXTI_CR3_EXTI11_Pos)          /*!< PB[11] pin */
#define EXTI_CR3_EXTI11_PC              (0x02U << EXTI_CR3_EXTI11_Pos)          /*!< PC[11] pin */
#define EXTI_CR3_EXTI11_PD              (0x03U << EXTI_CR3_EXTI11_Pos)          /*!< PD[11] pin */

/**
  * @brief EXTI_CR4 Register Bit Definition
  */
#define EXTI_CR4_EXTI12_Pos             (0)
#define EXTI_CR4_EXTI12                 (0x0FU << EXTI_CR4_EXTI12_Pos)          /*!< EXTI 12 configuration */
#define EXTI_CR4_EXTI12_PA              (0x00U << EXTI_CR4_EXTI12_Pos)          /*!< PA[12] pin */
#define EXTI_CR4_EXTI12_PB              (0x01U << EXTI_CR4_EXTI12_Pos)          /*!< PB[12] pin */
#define EXTI_CR4_EXTI12_PC              (0x02U << EXTI_CR4_EXTI12_Pos)          /*!< PC[12] pin */
#define EXTI_CR4_EXTI12_PD              (0x03U << EXTI_CR4_EXTI12_Pos)          /*!< PD[12] pin */

#define EXTI_CR4_EXTI13_Pos             (4)
#define EXTI_CR4_EXTI13                 (0x0FU << EXTI_CR4_EXTI13_Pos)          /*!< EXTI 13 configuration */
#define EXTI_CR4_EXTI13_PA              (0x00U << EXTI_CR4_EXTI13_Pos)          /*!< PA[13] pin */
#define EXTI_CR4_EXTI13_PB              (0x01U << EXTI_CR4_EXTI13_Pos)          /*!< PB[13] pin */
#define EXTI_CR4_EXTI13_PC              (0x02U << EXTI_CR4_EXTI13_Pos)          /*!< PC[13] pin */
#define EXTI_CR4_EXTI13_PD              (0x03U << EXTI_CR4_EXTI13_Pos)          /*!< PD[13] pin */

