redstonee/MM32G0001-CMake/Device/MM32G0001/Include/reg_exti.h
#define EXTI_CR4_EXTI14_Pos             (8)
#define EXTI_CR4_EXTI14                 (0x0FU << EXTI_CR4_EXTI14_Pos)          /*!< EXTI 14 configuration */
#define EXTI_CR4_EXTI14_PA              (0x00U << EXTI_CR4_EXTI14_Pos)          /*!< PA[14] pin */
#define EXTI_CR4_EXTI14_PB              (0x01U << EXTI_CR4_EXTI14_Pos)          /*!< PB[14] pin */
#define EXTI_CR4_EXTI14_PC              (0x02U << EXTI_CR4_EXTI14_Pos)          /*!< PC[14] pin */
#define EXTI_CR4_EXTI14_PD              (0x03U << EXTI_CR4_EXTI14_Pos)          /*!< PD[14] pin */

#define EXTI_CR4_EXTI15_Pos             (12)
#define EXTI_CR4_EXTI15                 (0x0FU << EXTI_CR4_EXTI15_Pos)          /*!< EXTI 15 configuration */
#define EXTI_CR4_EXTI15_PA              (0x00U << EXTI_CR4_EXTI15_Pos)          /*!< PA[15] pin */
#define EXTI_CR4_EXTI15_PB              (0x01U << EXTI_CR4_EXTI15_Pos)          /*!< PB[15] pin */
#define EXTI_CR4_EXTI15_PC              (0x02U << EXTI_CR4_EXTI15_Pos)          /*!< PC[15] pin */
#define EXTI_CR4_EXTI15_PD              (0x03U << EXTI_CR4_EXTI15_Pos)          /*!< PD[15] pin */

/**
  * @brief EXTI_IMR Register Bit Definition
  */
#define EXTI_IMR_0_Pos                  (0)
#define EXTI_IMR_0                      (0x01U << EXTI_IMR_0_Pos)               /*!< Interrupt Mask on line 0 */
#define EXTI_IMR_1_Pos                  (1)
#define EXTI_IMR_1                      (0x01U << EXTI_IMR_1_Pos)               /*!< Interrupt Mask on line 1 */
#define EXTI_IMR_2_Pos                  (2)
#define EXTI_IMR_2                      (0x01U << EXTI_IMR_2_Pos)               /*!< Interrupt Mask on line 2 */
#define EXTI_IMR_3_Pos                  (3)
#define EXTI_IMR_3                      (0x01U << EXTI_IMR_3_Pos)               /*!< Interrupt Mask on line 3 */
#define EXTI_IMR_4_Pos                  (4)
#define EXTI_IMR_4                      (0x01U << EXTI_IMR_4_Pos)               /*!< Interrupt Mask on line 4 */
#define EXTI_IMR_5_Pos                  (5)
#define EXTI_IMR_5                      (0x01U << EXTI_IMR_5_Pos)               /*!< Interrupt Mask on line 5 */
#define EXTI_IMR_6_Pos                  (6)
#define EXTI_IMR_6                      (0x01U << EXTI_IMR_6_Pos)               /*!< Interrupt Mask on line 6 */
#define EXTI_IMR_7_Pos                  (7)
#define EXTI_IMR_7                      (0x01U << EXTI_IMR_7_Pos)               /*!< Interrupt Mask on line 7 */
#define EXTI_IMR_8_Pos                  (8)
#define EXTI_IMR_8                      (0x01U << EXTI_IMR_8_Pos)               /*!< Interrupt Mask on line 8 */
#define EXTI_IMR_9_Pos                  (9)
#define EXTI_IMR_9                      (0x01U << EXTI_IMR_9_Pos)               /*!< Interrupt Mask on line 9 */
#define EXTI_IMR_10_Pos                 (10)
#define EXTI_IMR_10                     (0x01U << EXTI_IMR_10_Pos)              /*!< Interrupt Mask on line 10 */
#define EXTI_IMR_11_Pos                 (11)
#define EXTI_IMR_11                     (0x01U << EXTI_IMR_11_Pos)              /*!< Interrupt Mask on line 11 */
#define EXTI_IMR_12_Pos                 (12)
#define EXTI_IMR_12                     (0x01U << EXTI_IMR_12_Pos)              /*!< Interrupt Mask on line 12 */
#define EXTI_IMR_13_Pos                 (13)
#define EXTI_IMR_13                     (0x01U << EXTI_IMR_13_Pos)              /*!< Interrupt Mask on line 13 */
#define EXTI_IMR_14_Pos                 (14)
#define EXTI_IMR_14                     (0x01U << EXTI_IMR_14_Pos)              /*!< Interrupt Mask on line 14 */
#define EXTI_IMR_15_Pos                 (15)
#define EXTI_IMR_15                     (0x01U << EXTI_IMR_15_Pos)              /*!< Interrupt Mask on line 15 */
#define EXTI_IMR_16_Pos                 (16)
#define EXTI_IMR_16                     (0x01U << EXTI_IMR_16_Pos)              /*!< Interrupt Mask on line 16 */

#define EXTI_IMR_17_Pos                 (17)
#define EXTI_IMR_17                     (0x01U << EXTI_IMR_17_Pos)              /*!< Interrupt Mask on line 17 */

/**
  * @brief EXTI_EMR Register Bit Definition
  */
#define EXTI_EMR_0_Pos                  (0)
#define EXTI_EMR_0                      (0x01U << EXTI_EMR_0_Pos)               /*!< Event Mask on line 0 */
#define EXTI_EMR_1_Pos                  (1)
#define EXTI_EMR_1                      (0x01U << EXTI_EMR_1_Pos)               /*!< Event Mask on line 1 */
#define EXTI_EMR_2_Pos                  (2)
#define EXTI_EMR_2                      (0x01U << EXTI_EMR_2_Pos)               /*!< Event Mask on line 2 */
#define EXTI_EMR_3_Pos                  (3)
#define EXTI_EMR_3                      (0x01U << EXTI_EMR_3_Pos)               /*!< Event Mask on line 3 */
#define EXTI_EMR_4_Pos                  (4)
#define EXTI_EMR_4                      (0x01U << EXTI_EMR_4_Pos)               /*!< Event Mask on line 4 */
#define EXTI_EMR_5_Pos                  (5)
#define EXTI_EMR_5                      (0x01U << EXTI_EMR_5_Pos)               /*!< Event Mask on line 5 */
#define EXTI_EMR_6_Pos                  (6)
#define EXTI_EMR_6                      (0x01U << EXTI_EMR_6_Pos)               /*!< Event Mask on line 6 */
#define EXTI_EMR_7_Pos                  (7)
#define EXTI_EMR_7                      (0x01U << EXTI_EMR_7_Pos)               /*!< Event Mask on line 7 */
#define EXTI_EMR_8_Pos                  (8)
#define EXTI_EMR_8                      (0x01U << EXTI_EMR_8_Pos)               /*!< Event Mask on line 8 */
#define EXTI_EMR_9_Pos                  (9)
#define EXTI_EMR_9                      (0x01U << EXTI_EMR_9_Pos)               /*!< Event Mask on line 9 */
#define EXTI_EMR_10_Pos                 (10)
#define EXTI_EMR_10                     (0x01U << EXTI_EMR_10_Pos)              /*!< Event Mask on line 10 */
#define EXTI_EMR_11_Pos                 (11)
#define EXTI_EMR_11                     (0x01U << EXTI_EMR_11_Pos)              /*!< Event Mask on line 11 */
#define EXTI_EMR_12_Pos                 (12)
#define EXTI_EMR_12                     (0x01U << EXTI_EMR_12_Pos)              /*!< Event Mask on line 12 */
#define EXTI_EMR_13_Pos                 (13)
#define EXTI_EMR_13                     (0x01U << EXTI_EMR_13_Pos)              /*!< Event Mask on line 13 */
#define EXTI_EMR_14_Pos                 (14)
#define EXTI_EMR_14                     (0x01U << EXTI_EMR_14_Pos)              /*!< Event Mask on line 14 */
#define EXTI_EMR_15_Pos                 (15)
#define EXTI_EMR_15                     (0x01U << EXTI_EMR_15_Pos)              /*!< Event Mask on line 15 */
#define EXTI_EMR_16_Pos                 (16)
#define EXTI_EMR_16                     (0x01U << EXTI_EMR_16_Pos)              /*!< Event Mask on line 16 */

